from pyshortcuts import make_shortcut

# Укажите путь к вашему Python-скрипту
script_path = "C:/Users/HUAWEI/AppData/Local/Programs/Python/Python311/American pizza.py"

# Создайте ярлык
make_shortcut(script_path, name="American Pizza", icon="C:/Users/bekbo/OneDrive/Документы/osh/ico.ico")

print("Ярлык создан на рабочем столе.")
